# SetTessellationSettings Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
STLExportOptions..::..SetTessellationSettings Method
STLExportOptions Class See Also
---
Sets all the tessellation parameters to its predefined values for the given resolution type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public void SetTessellationSettings(
	STLExportResolution resolutionType
)
```

Visual Basic
---
```text
Public Sub SetTessellationSettings ( _
	resolutionType As STLExportResolution _
)
```

Visual C++
---
```text
public:
void SetTessellationSettings(
	STLExportResolution resolutionType
)
```

# ### Parameters
resolutionType
    Type: Autodesk.Revit.DB..::..STLExportResolution Type of STL exporting resolution.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
STLExportOptions Class
Autodesk.Revit.DB Namespace